def find_first_ocurrennce(arr, target):
    left, right = 0, len(arr) - 1
    safe = -1

    while left <= right:
        mid = left + (right - left) // 2      # используем более безопасный вариант вычисления диапазона и нахождения середины

        if arr[mid] == target:
            safe = mid # сохраняем вхождение чтобы затем вернуть в конце цикла. Каждую итерацию мы будем сдвигаться все левее отрезая правую часть пространства пока не останется одно единственное левое вхождение
            right = mid - 1 # (визуальный образ: перетаскиваем right влево) отрезаем правое пространство

        elif arr[mid] > target:
            right = mid - 1 # отрезаем правую часть
        else:
            left = mid + 1 # отрезаем левую часть

    return safe # после прохода по всем вхождениям target, возвращаем самое левое

array = [1, 3, 5, 5, 6, 7, 7, 7, 9, 11] # должен выводить 6й индекс вместо 5го

print(find_first_ocurrennce(array, 7))
