import math # для ceil # округляет деление вверх

# У нас есть сущности: 
# некая куча - куч элементов назовём её arrs (а внутри arrs — arr)
# speed — количество действий (объем работы) за ЕДИНИЦУ ВРЕМЕНИ (например за один час).
# max_hours (максимальное количество часов за которые поедаются кучи).
def predicate(arrs, speed, limit_time):
    # найти минимальную скорость K
    # за количество часов H
    all_hours = 0 # часы за которые проделана работа

    for arr in arrs:
        # перебираем каждую кучу в куче
        # берем количество элементов list и делим на скорость
        all_hours = all_hours + (math.ceil(arr / speed))

    # if не нужен
    return all_hours <= limit_time # True если успели по времени

def bs_find_min_speed(arr, max_hours):
    # минимальная скорость
    left = 1
    # максимальная скорость
    right = max(arr)
    safe = right

    while left <= right:
        mid = left + (right - left) // 2

        time_point = predicate(arr, mid, max_hours)

        if time_point:
            # Если количество дейстивий (объема работы) потребовалось гораздо меньше, и мы успели раньше дедлайна
            # Уменьшаем количество доступных действий отрезая правое пространство 
            safe = mid
            right = mid - 1
        else:
            # Наоборот, если доступное количество действий превысило дедлайн
            # Даем больше действий в час (увеличиваем мощность), отрезая левое пространство
            left = mid + 1
    return safe

# Тест-кейс для проверки в терминале:
piles_example = [3, 6, 7, 11]
hours = 4 # только при мощности в 11 (speed = 11) работник сможет справится с каждой задачей ровно до делайна.
# То есть, минимально допустимое значение при таргете 4, равно 11.


print(bs_find_min_speed(piles_example, hours))


