# import math ceil — нам не нужен чтобы округлять остаток, так как тут мы остаток отбрасываем.
# сразу выделим сущности задачи:
# массив кабелей - lengths
# гипотетическая длина из виртуального отрезка — workload — наша сущность "объема работы/количества действий за единицу времени"
# k — минимальный таргет кусков на который надо нарезать кабель 

def predicate(lengths, workload, k):
    all_pieces = 0
    # при workload = 6, максимальное значение all_pieces = 6
    # при 7, 5
    # при 8, 5 — восемь неправильный ответ.

    for length in lengths:
        # берем один кабель из массива кабелей
        # делим кабель на текущий объем работы
        all_pieces += length // workload 

    # ищем максимальную длину кабеля (mid/workload) при которой больше всего кусков all_pieces
    return all_pieces >= k

def bs_on_answer_max(arr, k):
    left = 1
    right = max(arr)
    safe = -1

    while left <= right:
        mid = left + (right - left) // 2

        # Наш answer который мы ищем
        answer = predicate(arr, mid, k)

        if answer:
            safe = mid
            # Мы отрезам левое пространство виртуальной оси, чтобы попытаться найти максимум
            left = mid + 1
        else:
            # Если работа не было выполнена за заданный объем работы,
            # то отрезаем правую сторону виртуальной шкалы, возвращаясь назад
            right = mid - 1

    return safe # возвращаем максимально допустимое найденное значение (mid) при k условии.

lengths_ex = [8, 11, 24] # Три кабеля в наличии
k_min = 4                  # Нам нужно получить минимум 4 куска

# Максимальная длина одного куска, при которой мы сможем нарезать 4 штуки — это 8 см.
# (Из первого кабеля выйдет 1 кусок, из второго — 1, из третьего — 2. Итого 1 + 1 + 2 = 4 куска).
print(bs_on_answer_max(lengths_ex, k_min)) # Должно вернуть 8 # ты был не прав

# обратная зависимость. При поиске максимально возможного значения: Чем больше длина одного куска (workload), тем меньше общее количество кусков (all_pieces) мы можем нарезать.
# Для поиска минимально допустимого: чем больше скорость, тем за меньшее количество времени мы успеваем сделать работу.
# Зеркальность заключается в нижней и верхней грани. Для максимально возможного значения — у нас нижний предел, для минимально допустимого значений — у нас верхний предел.
