# Binary search on floats / Continuous Space
# Заменяем условие цикла на точность — эпсилон.
# Нам нужно найти корень из числа с точность до 6 знаков после запятой (eps = 1e-7)
# Так как мы больше не можем сдвигать границы также как с целыми числами (mid +- 1), потому что знаки после запятой просто сломаются (грубо говоря),
# поэтому используем чистое присвоение left/right = mid чтобы перемещатся внутри границ знаков после запятой.

# функция предикат (чёрный ящик): нам нужно найти такое x чтобы, x**2 = 2
def f(x):
    return x**2

def bs_float_root(low, high, y, eps):
    left, right = low, high

    # получается эпсилон что-то вроде буфера
    while (right - left) > eps:
        mid = left + (right - left) / 2

        current_y = f(mid)

        if current_y > y:
            right = mid

        else:
            left = mid

    return mid

target_y = 2.0
eps = 1e-7 # Точность (7 знаков после запятой)

# Результат должен быть равен примерно 1.4142135...
print(bs_float_root(0.0, 2.0, target_y, eps))