# Инструмент: Вещественный бинарный поиск с шагом в mid и контролем коридора через точность epsilon.

def area_factor(x):
    # Я не понял все те формулы, но походу, чтобы не перегружать код, мы сократим поиск до возведение в квадрат
    return x**2

def bs_geometry_radius(low, high, y, eps):
    left, right = low, high
    iterations = 0

    # вещественный поиск
    while (right - left) > eps:
        # Отладочная строка для дебаггера: разность с фиксированными 10 знаками после запятой
        # Это покажет реальную ширину коридора: 0.0000015 -> 0.0000003 -> 0.00000007...
        iterations += 1
        print(f"Итерация: {iterations}. Коридор: {(right - left)}")


        mid = left + (right - left) / 2

        # условная площадь круг
        radius_r = area_factor(mid)

        # ты говорил, что поиск похож на монотонную функцию
        # значит в какой-то момент когда мы дойдем до основания, то начнем падать
        # следовательно нужно найти максимально близкое к основанию (ну я так думаю, если бы это была формула)
        
        if radius_r > y:
            right = mid

        else:
            left = mid

    return f"Корень из {y} = {mid}"


target_y = 50.0 # Наша цель половина площади большого круга
eps = 1e-7

# Математически точный ответ — это корень из 50 (примерно 7.0710678...)
print(bs_geometry_radius(0.0, 10.0, target_y, eps))